# Указывает метаданные о контейнере, в данном случае — авторе
#LABEL authors="Принцесуха"

# Указывает команду, которая будет выполняться при запуске контейнера,
# запуская основное приложение Spring Boot
# CMD ["java", "-jar", "app.jar"]

# Выполняет сборку проекта с помощью Maven, пропуская выполнение тестов
#RUN mvn clean install -DskripTests

# Используем официальный образ OpenJDK 17 с минимальным размером
FROM openjdk:17-jdk-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Указываем, что контейнер будет слушать на порту 8080
EXPOSE 8080

# Копируем JAR-файл из целевой директории в контейнер
COPY target/*.jar /app.jar

# Задаем команду для запуска приложения при старте контейнера
ENTRYPOINT ["java", "-jar", "/app.jar"]

